#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	ЭтоЮрЛицо = (ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо);
	ТекстОшибки = "";

	Если ЗначениеЗаполнено(ИНН) Тогда

		Если Не КонтрагентыКлиентСервер.ИННСоответствуетТребованиям(ИНН, ЭтоЮрЛицо, ТекстОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Ссылка, "ИНН", "Объект", Отказ);
		ИначеЕсли Справочники.Контрагенты.ИННЗанят(ИНН, КПП, Ссылка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Контрагент с ИНН %1 и КПП %2 уже есть в справочнике'"), ИНН, КПП),
				Ссылка, "ИНН", "Объект", Отказ);
		КонецЕсли;

	КонецЕсли;

	Если ЗначениеЗаполнено(КПП) Тогда
		Если Не ЭтоЮрЛицо Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'КПП указывается только для юридических лиц'"), Ссылка, "КПП", "Объект", Отказ);
		ИначеЕсли Не КонтрагентыКлиентСервер.КППСоответствуетТребованиям(КПП, ТекстОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Ссылка, "КПП", "Объект", Отказ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЭтоГруппа Тогда
		ИНН = СокрЛП(ИНН);
		КПП = СокрЛП(КПП);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
