#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)

	// При старте сеанса ТребуемыеПараметры = Неопределено, при обращении к неустановленному
	// параметру - массив имен. Модуль сеанса выполняется в привилегированном режиме.
	Если ТребуемыеПараметры = Неопределено
		Или ТребуемыеПараметры.Найти("ТекущийПользователь") <> Неопределено Тогда
		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.ТекущийПользователь();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
