///////////////////////////////////////////////////////////////////////////////////////////////////////
// Серверные вызовы печати с клиента.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует накладную по реализациям.
//
// Параметры:
//  СписокДокументов - Массив из ДокументСсылка.РеализацияТоваров, ДокументСсылка.РеализацияТоваров - что печатать.
//
// Возвращаемое значение:
//  ТабличныйДокумент - печатная форма.
//
Функция НакладнаяНаОтпускТоваров(Знач СписокДокументов) Экспорт

	Если ТипЗнч(СписокДокументов) <> Тип("Массив") Тогда
		Документ = СписокДокументов;
		СписокДокументов = Новый Массив;
		СписокДокументов.Добавить(Документ);
	КонецЕсли;

	Возврат ПечатьСервер.НакладнаяНаОтпускТоваров(СписокДокументов);

КонецФункции

#КонецОбласти
